extensions package list
Agenric.cocoapods-snippets@1.0.0
bungcip.better-toml@0.3.2
cweijan.vscode-mysql-manager@1.5.2
donjayamanne.githistory@0.4.13
eamodio.gitlens@10.2.0
felipecaputo.git-project-manager@1.7.1
jakebathman.mysql-syntax@1.3.1
janisdd.vscode-edit-csv@0.2.5
KnisterPeter.vscode-commitizen@0.8.4
mechatroner.rainbow-csv@1.4.0
mhcpnl.xcodestrings@1.0.0
mikestead.dotenv@1.0.1
ms-azuretools.vscode-docker@0.9.0
ms-kubernetes-tools.vscode-kubernetes-tools@1.0.9
ms-python.python@2020.1.58038
ms-vscode.cpptools@0.26.2
ms-vscode.Go@0.12.0
rebornix.ruby@0.26.0
redhat.vscode-yaml@0.6.1
Shan.code-settings-sync@3.4.3
streetsidesoftware.code-spell-checker@1.7.20
vscode-icons-team.vscode-icons@9.7.0
wingrunr21.vscode-ruby@0.26.0
yzhang.markdown-all-in-one@2.7.0

extensions package install list
code --install-extension Agenric.cocoapods-snippets
code --install-extension bungcip.better-toml
code --install-extension cweijan.vscode-mysql-manager
code --install-extension donjayamanne.githistory
code --install-extension eamodio.gitlens
code --install-extension felipecaputo.git-project-manager
code --install-extension jakebathman.mysql-syntax
code --install-extension janisdd.vscode-edit-csv
code --install-extension KnisterPeter.vscode-commitizen
code --install-extension mechatroner.rainbow-csv
code --install-extension mhcpnl.xcodestrings
code --install-extension mikestead.dotenv
code --install-extension ms-azuretools.vscode-docker
code --install-extension ms-kubernetes-tools.vscode-kubernetes-tools
code --install-extension ms-python.python
code --install-extension ms-vscode.cpptools
code --install-extension ms-vscode.Go
code --install-extension rebornix.ruby
code --install-extension redhat.vscode-yaml
code --install-extension Shan.code-settings-sync
code --install-extension streetsidesoftware.code-spell-checker
code --install-extension vscode-icons-team.vscode-icons
code --install-extension wingrunr21.vscode-ruby
code --install-extension yzhang.markdown-all-in-one
