tap "buo/cask-upgrade"
tap "homebrew/bundle"
tap "homebrew/cask"
tap "homebrew/core"
# C/C++ resolver library and DNS resolver utilities
brew "adns"
# Automatic configure script builder
brew "autoconf"
# Tool for generating GNU Standards-compliant Makefiles
brew "automake"
# GNU File, Shell, and Text utilities
brew "coreutils"
# Open source programming language to build simple/reliable/efficient software
brew "go"
# Go dependency management tool
brew "dep"
# Program that can automate interactive applications
brew "expect"
# GNU database manager
brew "gdbm"
# GNU internationalization (i18n) and localization (l10n) library
brew "gettext"
# GNU multiple precision arithmetic library
brew "gmp"
# Portable Foreign Function Interface library
brew "libffi"
# ASN.1 structure parser library
brew "libtasn1"
# C string library for manipulating Unicode strings
brew "libunistring"
# GNU Transport Layer Security (TLS) Library
brew "gnutls"
# Common error values for all GnuPG components
brew "libgpg-error"
# Assuan IPC Library
brew "libassuan"
# Cryptographic library based on the code from GnuPG
brew "libgcrypt"
# X.509 and CMS library
brew "libksba"
# GNU Pretty Good Privacy (PGP) package
brew "gnupg"
# Generic library support script
brew "libtool"
# YAML Parser
brew "libyaml"
# Powerful, lightweight programming language
brew "lua"
# Mac App Store command-line interface
brew "mas"
# SSL/TLS cryptography library
brew "openssl"
# Library for command-line editing
brew "readline"
# Intercept, modify, replay, save HTTP/S traffic
brew "mitmproxy"
# NCurses Disk Usage
brew "ncdu"
# Manage compile and link flags for libraries
brew "pkg-config"
# Web caching proxy
brew "polipo"
# Advanced filtering web proxy
brew "privoxy"
# Pyenv plugin to manage virtualenv
brew "pyenv-virtualenv"
# Alternative to pyenv for managing virtualenvs
brew "pyenv-virtualenvwrapper"
# Organize software neatly under a single directory tree (e.g. /usr/local)
brew "stow"
# Display directories as trees (with optional color/HTML output)
brew "tree"
# Extract, view, and test RAR archives
brew "unrar"
cask "bitbar"
cask "captin"
cask "cheatsheet"
cask "docker"
cask "dropbox"
cask "firefox"
cask "flux"
cask "go2shell"
cask "google-chrome"
cask "hammerspoon"
cask "iina"
cask "iterm2"
cask "keycastr"
cask "lepton"
cask "licecap"
cask "postman"
cask "qq"
cask "save-hollywood"
cask "shuttle"
cask "sogouinput"
cask "sourcetree"
cask "typora"
cask "xmind"
mas "GarageBand", id: 682658836
mas "iMovie", id: 408981434
mas "Keynote", id: 409183694
mas "Numbers", id: 409203825
mas "OhMyStar2", id: 1218642292
mas "Pages", id: 409201541
mas "WeChat", id: 836500024
mas "Xcode", id: 497799835
mas "网易有道词典", id: 491854842
