aerial
appcleaner
appium
bitbar
captin
charles
cheatsheet
cryptomator
docker
dropbox
firefox
flux
foxmail
go2shell
google-chrome
hammerspoon
iina
iterm2
keycastr
lepton
licecap
macs-fan-control
neteasemusic
postman
qq
save-hollywood
sequel-pro-nightly
shadowsocksx-ng
shuttle
sourcetree
textmate
typora
ubersicht
visual-studio-code
webviewscreensaver
wechat
wireshark
xmind-zen
