bitbar
captin
cheatsheet
cryptomator
docker
dropbox
firefox
flux
go2shell
google-chrome
hammerspoon
iina
iterm2
keycastr
lepton
licecap
postman
qq
save-hollywood
shuttle
sogouinput
sourcetree
typora
xmind
